* Notes

** Emacs Shortcuts

Save |  Ctrl-X ,  Ctrl-S

Clear Buffers | Ctrl-X , 1

Split Vert| Ctrl-X , 3

Split Hor | Ctrl-X , 2

Directory | Ctrl-X , Ctrl-D

Compiling | Ctrl-C , Ctrl-C

Shell | Alt-X , "Shell"

Change Buffers | Ctrl-X , B

Kill Buffer | Ctrl-X , K

Exit Emacs | Ctrl-X , Ctrl-C

Undo | Ctrl-X , U

Copy | Alt-W

Paste | Ctrl-Y

Cut | Ctrl-W

Delete Line | Crtl-K

Clock In | Ctrl-C , Ctrl-X , Ctrl-I

Clock Out | Ctrl-C , Ctrl-X , Ctrl-O

End-of-file | Ctrl-D



** C++ Keywords
alignas **
alignof **
and
and_eq
asm
auto
bitand
bitor
bool *
break
case
catch	char
char16_t **
char32_t **
class
compl
const
constexpr **
const_cast *
continue
decltype
default
delete	do
double
dynamic_cast *
else
enum
explicit *
export *
extern
false *
float
for
friend	goto
if
inline
int
long
mutable *
namespace *
new
noexcept **
not
not_eq
nullptr **	operator
or
or_eq
private
protected
public
register
reinterpret_cast *
return
short
signed
sizeof	static
static_assert **
static_cast *
struct
switch
template
this
thread_local **
throw
true *
try
typedef	typeid *
typename *
union
unsigned
using *
virtual
void
volatile
wchar_t *
while
xor
xor_eq


** Emails From MC

--------------------------------------------------------------------------------
1. copy files from green USB key for boost and wt. copy them into ~/Development.
2. unpack boost:

tar -xaf boost_1_66_0.tar.bz2

3. build boost:

cd boost_1_66_0/
./bootstrap.sh
./b2 --prefix=/home/marco/local
./b2 --prefix=/home/marco/local --install

replace "marco" with your username, here and on all other commands below.

4. when boost is finished, you can start with witty. unpack witty:

tar -xaf witty-4.0.2.tar.gz

5. build witty:

cd wt-4.0.2
set CMAKE_INCLUDE_PATH=/home/marco/local/include
set CMAKE_LIBRARY_PATH=/home/marco/local/lib
mkdir build
cmake ..
make -j 2
make install

6. create a new project, and add the following to the CMake file (in
addition to what you normally add) add the following:

6.1 after the project:

find_package(Wt REQUIRED)

6.2 after the target (e.g. the line with target_link_libraries):

target_link_libraries(PROJECT ${Wt_LIBRARIES})

7. manually copy the contents of this file:

https://www.webtoolkit.eu/wt/src/hello

8. build and run it. you need to run it with the following parameters:

./PROJECT  --docroot . --http-address 0.0.0.0 --http-port 8080

9. go to chrome and type:

http://localhost:8080

if all goes well you should see the hello world.
----------------------------------------------------------------------------------


* Tasks

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2018-01-23 Tue 12:43]
| <75>                                                                        |         |      |   |       |
| Headline                                                                    | Time    |      |   |     % |
|-----------------------------------------------------------------------------+---------+------+---+-------|
| *Total time*                                                                | *53:35* |      |   | 100.0 |
|-----------------------------------------------------------------------------+---------+------+---+-------|
| Tasks                                                                       | 53:35   |      |   | 100.0 |
| Setup CMake                                                                 |         | 0:46 |   |   1.4 |
| Reviewing yesterdays Grades task                                            |         | 2:13 |   |   4.1 |
| Copy across hello world from wt (And how to run wt)                         |         | 0:50 |   |   1.6 |
| Adding numbers on wt                                                        |         | 0:44 |   |   1.4 |
| Watch tutorials on youtube                                                  |         | 2:03 |   |   3.8 |
| Attempt to use wt solo                                                      |         | 1:24 |   |   2.6 |
| Practice C++                                                                |         | 1:28 |   |   2.7 |
| Reading "Learn C++"                                                         |         | 6:23 |   |  11.9 |
| Cleaning/Updating tasks.org                                                 |         | 1:53 |   |   3.5 |
| Making 21 game                                                              |         | 4:38 |   |   8.6 |
| Comparing NI and mines 21 games                                             |         | 0:37 |   |   1.2 |
| Discussing a task with NI                                                   |         | 3:10 |   |   5.9 |
| Creating a simple shopping checkout                                         |         | 2:57 |   |   5.5 |
| Studying different loops etc etc                                            |         | 0:32 |   |   1.0 |
| Writing a text base adventure                                               |         | 5:03 |   |   9.4 |
| Comparing NI and mines Text Adv                                             |         | 0:48 |   |   1.5 |
| Trying to get ERC to work                                                   |         | 1:37 |   |   3.0 |
| Writing Tic Tac Toe game                                                    |         | 3:25 |   |   6.4 |
| Comparing NI and mines TicTacToe                                            |         | 0:12 |   |   0.4 |
| Look for C++ tasks online                                                   |         | 0:19 |   |   0.6 |
| Writing a Number Pyramid                                                    |         | 2:18 |   |   4.3 |
| Comparing NI and mines Pyramid                                              |         | 0:33 |   |   1.0 |
| Writing a Bar Chart                                                         |         | 3:32 |   |   6.6 |
| Comparing NI and mines Bar Charts                                           |         | 0:05 |   |   0.2 |
| Writing New RPG                                                             |         | 3:07 |   |   5.8 |
| Discussing NI and mines New RPG                                             |         | 2:31 |   |   4.7 |
| Researching Arrays                                                          |         | 0:27 |   |   0.8 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end:

** Setup CMake
   CLOCK: [2018-01-04 Thu 13:29]--[2018-01-04 Thu 14:15] =>  0:46

- link to tutorial: http://derekmolloy.ie/hello-world-introductions-to-cmake/
- read tutorial and setup cmake

** Reviewing yesterdays Grades task
   CLOCK: [2018-01-09 Tue 09:48]--[2018-01-09 Tue 12:01] =>  2:13

-Changing small parts of the code and seeing the results
-Double: next level of float. More decimal places (kinda)
-setPrecision: Sets the decimal precision to be used to format floating-point
values on output operations.

** Installed Wt
** Copy across hello world from wt (And how to run wt)
   CLOCK: [2018-01-09 Tue 14:10]--[2018-01-09 Tue 14:21] =>  0:11
   CLOCK: [2018-01-09 Tue 13:30]--[2018-01-09 Tue 14:09] =>  0:39

- To run:
./hellowt --docroot . --http-listen 0.0.0.0:8080
-Compile Adress template:
cd ~/Development/HelloWorld/hellowt/build && CMAKE_INCLUDE_PATH=/home/patrick/local/include CMAKE_LIBRARY_PATH=/home/patrick/local/lib cmake .. && make -j4
** Adding numbers on wt
   CLOCK: [2018-01-09 Tue 15:02]--[2018-01-09 Tue 15:46] =>  0:44
** Watch tutorials on youtube
   CLOCK: [2018-01-10 Wed 14:14]--[2018-01-10 Wed 15:29] =>  1:15
   CLOCK: [2018-01-10 Wed 13:04]--[2018-01-10 Wed 13:52] =>  0:48

- watch youtube videos sent by MC and N

** Attempt to use wt solo
   CLOCK: [2018-01-10 Wed 15:37]--[2018-01-10 Wed 17:01] =>  2:24

- Trying to recreate something on a web page using wt

** Practice C++
   CLOCK: [2018-01-11 Thu 14:31]--[2018-01-11 Thu 15:17] =>  0:46
   CLOCK: [2018-01-11 Thu 09:32]--[2018-01-11 Thu 10:14] =>  0:42


-Trying to create something in C++ without looking at ref
-Try to incorporate all that I've learned

** Reading "Learn C++"
   CLOCK: [2018-01-22 Mon 09:00]--[2018-01-22 Mon 09:41] =>  0:41
   CLOCK: [2018-01-19 Fri 16:05]--[2018-01-19 Fri 16:39] =>  0:34
   CLOCK: [2018-01-19 Fri 09:06]--[2018-01-19 Fri 10:01] =>  0:55
   CLOCK: [2018-01-18 Thu 16:12]--[2018-01-18 Thu 17:03] =>  0:51
   CLOCK: [2018-01-18 Thu 10:51]--[2018-01-18 Thu 11:40] =>  0:49
   CLOCK: [2018-01-16 Tue 09:16]--[2018-01-16 Tue 09:49] =>  0:33
   CLOCK: [2018-01-11 Thu 16:24]--[2018-01-11 Thu 17:02] =>  0:38
   CLOCK: [2018-01-11 Thu 13:09]--[2018-01-11 Thu 13:37] =>  0:28
   CLOCK: [2018-01-11 Thu 10:58]--[2018-01-11 Thu 11:52] =>  0:54


-Completed Chapter 1
-Completed Chapter 2
-Completed Chapter 3
-Leaving the questions until the end
-Upto: 1.11 (Done)
-Upto: 2.9 (Done)
-Chapter 2 questions need to be done
-Upto: 3.3 (Done)
-Chapter 3 need to be done
** Cleaning/Updating tasks.org
   CLOCK: [2018-01-23 Tue 12:29]--[2018-01-23 Tue 12:42] =>  0:13
   CLOCK: [2018-01-22 Mon 14:49]--[2018-01-22 Mon 15:00] =>  0:11
   CLOCK: [2018-01-19 Fri 15:49]--[2018-01-19 Fri 16:03] =>  0:14
   CLOCK: [2018-01-19 Fri 13:07]--[2018-01-19 Fri 13:23] =>  0:16
   CLOCK: [2018-01-17 Wed 15:07]--[2018-01-17 Wed 15:28] =>  0:21
   CLOCK: [2018-01-16 Tue 12:29]--[2018-01-16 Tue 12:51] =>  0:22
   CLOCK: [2018-01-11 Thu 13:44]--[2018-01-11 Thu 14:00] =>  0:16

//- Accidentally added something to the bottom of tasks
//- Don't know how to get rid of it
- Got rid of it
** Making 21 game
   CLOCK: [2018-01-12 Fri 16:32]--[2018-01-12 Fri 17:04] =>  0:32
   CLOCK: [2018-01-12 Fri 15:12]--[2018-01-12 Fri 16:08] =>  0:56
   CLOCK: [2018-01-12 Fri 13:12]--[2018-01-12 Fri 14:50] =>  1:38
   CLOCK: [2018-01-12 Fri 11:06]--[2018-01-12 Fri 12:14] =>  1:08
   CLOCK: [2018-01-12 Fri 10:20]--[2018-01-12 Fri 10:44] =>  0:24

- randomly generate number for player and cpu
- hide cpu cards
- ask player if they'd like to hit
- ask cpu if they'd like to hit
- when player holds ask cpu
- when both hold, reveal cpu cards
- annouce winner
- ask if they would like to play again

** Comparing NI and mines 21 games
   CLOCK: [2018-01-12 Fri 16:12]--[2018-01-12 Fri 16:30] =>  0:18
   CLOCK: [2018-01-12 Fri 14:50]--[2018-01-12 Fri 15:09] =>  0:19

- do {
        whatever
     } while ( !condition );
- break;
** Discussing a task with NI
   CLOCK: [2018-01-22 Mon 11:53]--[2018-01-22 Mon 12:33] =>  0:40
   CLOCK: [2018-01-19 Fri 10:03]--[2018-01-19 Fri 10:34] =>  0:31
   CLOCK: [2018-01-18 Thu 10:22]--[2018-01-18 Thu 10:43] =>  0:21
   CLOCK: [2018-01-18 Thu 09:51]--[2018-01-18 Thu 10:09] =>  0:18
   CLOCK: [2018-01-17 Wed 11:22]--[2018-01-17 Wed 11:30] =>  0:08
   CLOCK: [2018-01-17 Wed 10:30]--[2018-01-17 Wed 11:04] =>  0:34
   CLOCK: [2018-01-16 Tue 09:44]--[2018-01-16 Tue 09:54] =>  0:10
   CLOCK: [2018-01-15 Mon 11:36]--[2018-01-15 Mon 12:04] =>  0:28

** Creating a simple shopping checkout
   CLOCK: [2018-01-15 Mon 17:06]--[2018-01-15 Mon 17:15] =>  0:09
   CLOCK: [2018-01-15 Mon 15:07]--[2018-01-15 Mon 16:26] =>  1:19
   CLOCK: [2018-01-15 Mon 12:10]--[2018-01-15 Mon 13:39] =>  1:29


- create a list of items
- give each item a price
- allow user to price check without adding to list
- make option to start list
- ask the user for input of what they want
- make it possible so order of input of items doesn't matter
- show total
- wrong total, unsure why
- ^^fixed
** Studying different loops etc etc
   CLOCK: [2018-01-15 Mon 13:47]--[2018-01-15 Mon 14:19] =>  0:32

- Different Loops:

- For Loop
- While Loop
- do...while Loop

- Other important words:

- break
- return
- *goto
- *continue
** Writing a text base adventure
   CLOCK: [2018-01-22 Mon 10:30]--[2018-01-22 Mon 11:48] =>  1:18
   CLOCK: [2018-01-16 Tue 13:47]--[2018-01-16 Tue 16:04] =>  2:17
   CLOCK: [2018-01-16 Tue 11:23]--[2018-01-16 Tue 11:56] =>  0:33
   CLOCK: [2018-01-16 Tue 10:03]--[2018-01-16 Tue 10:58] =>  0:55
** Comparing NI and mines Text Adv
   CLOCK: [2018-01-16 Tue 16:05]--[2018-01-16 Tue 16:26] =>  0:21
   CLOCK: [2018-01-16 Tue 12:02]--[2018-01-16 Tue 12:29] =>  0:27


-Classes:
create a Class to store vars inside them and use them only for that one
class, for example:

class Character {
public:
    int health;
    int stamina;
    int attack;
};

int main()
{
    Character player;
    player.health = 100;
    player.stamina = 5;
    player.attack = 25;
    }
** Trying to get ERC to work
   CLOCK: [2018-01-18 Thu 08:57]--[2018-01-18 Thu 09:23] =>  0:26
   CLOCK: [2018-01-17 Wed 09:03]--[2018-01-17 Wed 10:14] =>  1:11

** Writing Tic Tac Toe game
   CLOCK: [2018-01-17 Wed 15:33]--[2018-01-17 Wed 16:08] =>  0:35
   CLOCK: [2018-01-17 Wed 14:13]--[2018-01-17 Wed 15:01] =>  0:48
   CLOCK: [2018-01-17 Wed 11:30]--[2018-01-17 Wed 13:32] =>  2:02

- create a grid
- designate each space a number
- ask for player input
- cpu chooses empty space
- output winner

** Comparing NI and mines TicTacToe
   CLOCK: [2018-01-17 Wed 16:09]--[2018-01-17 Wed 16:21] =>  0:12

** Look for C++ tasks online
   CLOCK: [2018-01-18 Thu 12:09]--[2018-01-18 Thu 12:28] =>  0:19

- Search for beginner C++ tasks
- Ones that use func and var that we dont know

** Writing a Number Pyramid
   CLOCK: [2018-01-18 Thu 14:24]--[2018-01-18 Thu 15:49] =>  1:25
   CLOCK: [2018-01-18 Thu 13:54]--[2018-01-18 Thu 14:19] =>  0:25
   CLOCK: [2018-01-18 Thu 13:04]--[2018-01-18 Thu 13:32] =>  0:28

- Follow tutuorial on:
- https://www.programiz.com/cpp-programming/examples/pyramid-pattern
- Make pyramid with "*'s"
- Then solo with numbers
- Do all examples in this manner
- See if i can incorperate into old projects

** Comparing NI and mines Pyramid
   CLOCK: [2018-01-18 Thu 15:49]--[2018-01-18 Thu 16:05] =>  0:16
   CLOCK: [2018-01-18 Thu 14:19]--[2018-01-18 Thu 14:23] =>  0:04
   CLOCK: [2018-01-18 Thu 13:39]--[2018-01-18 Thu 13:52] =>  0:13

** Writing a Bar Chart
   CLOCK: [2018-01-19 Fri 15:34]--[2018-01-19 Fri 15:46] =>  0:12
   CLOCK: [2018-01-19 Fri 14:56]--[2018-01-19 Fri 15:30] =>  0:34
   CLOCK: [2018-01-19 Fri 14:04]--[2018-01-19 Fri 14:36] =>  0:32
   CLOCK: [2018-01-19 Fri 10:43]--[2018-01-19 Fri 12:57] =>  2:14

- Create a blank chart
- User input names
- User input age
- User create a bar based on age
- Incorporate bar into chart
- Tried to have the user change variables to no avail
- breaks the chart format
** Comparing NI and mines Bar Charts
   CLOCK: [2018-01-19 Fri 14:37]--[2018-01-19 Fri 14:42] =>  0:05
** Writing New RPG
   CLOCK: [2018-01-23 Tue 10:27]--[2018-01-23 Tue 11:03] =>  2:07
   CLOCK: [2018-01-23 Tue 09:23]--[2018-01-23 Tue 09:41] =>  0:18
   CLOCK: [2018-01-22 Mon 16:18]--[2018-01-22 Mon 16:47] =>  0:29
   CLOCK: [2018-01-22 Mon 15:07]--[2018-01-22 Mon 16:05] =>  0:58
   CLOCK: [2018-01-22 Mon 13:53]--[2018-01-22 Mon 14:27] =>  0:34
   CLOCK: [2018-01-22 Mon 12:35]--[2018-01-22 Mon 12:47] =>  0:12

-

** Discussing NI and mines New RPG
   CLOCK: [2018-01-23 Tue 11:58]--[2018-01-23 Tue 12:28] =>  0:30
   CLOCK: [2018-01-23 Tue 11:04]--[2018-01-23 Tue 11:27] =>  0:23
   CLOCK: [2018-01-23 Tue 09:41]--[2018-01-23 Tue 10:03] =>  0:22
   CLOCK: [2018-01-23 Tue 09:09]--[2018-01-23 Tue 09:22] =>  0:13
   CLOCK: [2018-01-22 Mon 16:06]--[2018-01-22 Mon 16:17] =>  0:11
   CLOCK: [2018-01-22 Mon 14:28]--[2018-01-22 Mon 14:48] =>  0:20
   CLOCK: [2018-01-22 Mon 12:47]--[2018-01-22 Mon 13:19] =>  0:32
** Researching Arrays
   CLOCK: [2018-01-23 Tue 11:28]--[2018-01-23 Tue 11:55] =>  0:27

string inv[3] = {"knife", "gold", "torch"};
    for (int i=0; i< 2; i++){
           cout << inv[i] << "\n";
        }
        cout << inv[i] << "\n";
